STMicroelectronics/STM32CubeMP13/Drivers/BSP/STM32MP13xx_DISCO/stm32mp13xx_disco.c
/**

  ******************************************************************************

  * @file    stm32mp13xx_disco.c
  * @author  MCD Application Team
  * @brief   This file provides a set of firmware functions to manage LEDs,
  *          push-buttons and COM ports available on STM32MP13xx-DISCO
  *          discovery board from STMicroelectronics.
  *
  @verbatim
  *
  @endverbatim
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020-2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp13xx_disco.h"

#if defined MCP_IOEXPANDER
#include "stm32mp13xx_disco_io.h"
#endif

#include "stdio.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32MP13XX_DISCO
  * @{
  */

/** @defgroup STM32MP13XX_DISCO_LOW_LEVEL_Private_TypesDefinitions Private Typedef
  * @{
  */
typedef void (* BSP_EXTI_LineCallback)(void);
/**
  * @}
  */

/** @defgroup STM32MP13XX_DISCO_LOW_LEVEL_Private_Defines Private Def
  * @{
  */

/** @brief STM32MP13XX DISCO BSP Driver version number V0.0.2
  */
#define STM32MP13XX_DISCO_BSP_VERSION_MAIN   (0x01U) /*!< [31:24] main version */
#define STM32MP13XX_DISCO_BSP_VERSION_SUB1   (0x01U) /*!< [23:16] sub1 version */
#define STM32MP13XX_DISCO_BSP_VERSION_SUB2   (0x00U) /*!< [15:8]  sub2 version */
#define STM32MP13XX_DISCO_BSP_VERSION_RC     (0x00U) /*!< [7:0]  release candidate */
#define STM32MP13XX_DISCO_BSP_VERSION         ((STM32MP13XX_DISCO_BSP_VERSION_MAIN << 24)\
                                             |(STM32MP13XX_DISCO_BSP_VERSION_SUB1 << 16)\
                                             |(STM32MP13XX_DISCO_BSP_VERSION_SUB2 << 8 )\
                                             |(STM32MP13XX_DISCO_BSP_VERSION_RC))
/**
  * @}
  */


/** @defgroup STM32MP13XX_DISCO_LOW_LEVEL_Private_Variables Private Variables
  * @{
  */

static GPIO_TypeDef* LED_PORT[LEDn] = {LED3_GPIO_PORT,
                                       LED4_GPIO_PORT,
#if defined (MCP_IOEXPANDER) /* need MCP IOEXPANDER usage for LED6 and LED7*/
									   LED6_GPIO_PORT,
                                       LED7_GPIO_PORT
#endif
                                      };

static const uint16_t LED_PIN[LEDn] = {LED3_PIN,
                                       LED4_PIN,
#if defined (MCP_IOEXPANDER) /* need MCP IOEXPANDER usage for LED6 and LED7*/
                                       LED6_PIN,
                                       LED7_PIN
#endif
                                      };


static GPIO_TypeDef* BUTTON_PORT[BUTTONn] = {WAKEUP_BUTTON_GPIO_PORT,
                                             USER_BUTTON_GPIO_PORT,
                                             USER2_BUTTON_GPIO_PORT,
                                             TAMPER_BUTTON_GPIO_PORT};

static const uint16_t BUTTON_PIN[BUTTONn] = {WAKEUP_BUTTON_PIN,
                                             USER_BUTTON_PIN,
                                             USER2_BUTTON_PIN,
                                             TAMPER_BUTTON_PIN};

static const IRQn_Type BUTTON_IRQn[BUTTONn] = {WAKEUP_BUTTON_EXTI_IRQn,
                                              USER_BUTTON_EXTI_IRQn,
                                              USER2_BUTTON_EXTI_IRQn,
                                              TAMPER_BUTTON_EXTI_IRQn};

#ifdef HAL_EXTI_MODULE_ENABLED
static EXTI_HandleTypeDef   hExtiButtonHandle[BUTTONn];
#endif

#if (USE_BSP_COM_FEATURE == 1)
#ifdef HAL_UART_MODULE_ENABLED
static USART_TypeDef* COM_USART[COMn] = {COM1_UART};

static UART_HandleTypeDef hComHandle[COMn];

#if (USE_COM_LOG == 1)
static COM_TypeDef COM_ActiveLogPort = COM1;
#endif

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
static uint32_t IsComMspCbValid[COMn] = {0};
#endif

#endif
#endif /* (USE_BSP_COM_FEATURE == 1) */

/**
  * @}
  */


/** @defgroup STM32MP13XX_DISCO_LOW_LEVEL_Private_FunctionPrototypes Private Prototypes
  * @{
  */
#ifdef HAL_EXTI_MODULE_ENABLED
static void BUTTON_WAKEUP_EXTI_Callback(void);
static void BUTTON_USER_EXTI_Callback(void);
static void BUTTON_USER2_EXTI_Callback(void);
static void BUTTON_TAMPER_EXTI_Callback(void);
#endif

#if (USE_BSP_COM_FEATURE == 1)
#ifdef HAL_UART_MODULE_ENABLED
static void COM1_MspInit(UART_HandleTypeDef *huart);
static void COM1_MspDeInit(UART_HandleTypeDef *huart);
#endif
#endif /* (USE_BSP_COM_FEATURE == 1) */
/**
  * @}
  */


/** @addtogroup STM32MP13XX_DISCO_LOW_LEVEL_Exported_Functions Exported Functions
  * @{
  */

  /**
  * @brief  This method returns the STM32MP13XX DISCO BSP Driver revision
  * @retval version: 0xXYZR (8bits for each decimal, R for RC)
  */
uint32_t BSP_GetVersion(void)
{
  return STM32MP13XX_DISCO_BSP_VERSION;
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void BSP_Error_Handler(void)
{
  BSP_LED_Init(LED_RED);

  /* Infinite loop */
  while(1)
  {
    /* Toggle LED_RED */
    BSP_LED_Toggle(LED_RED);
    HAL_Delay(500);
  }
}

/** @addtogroup STM32MP13XX_DISCO_LOW_LEVEL_Exported_Functions_Group1 LED Functions
  * @{
  */
/**
  * @brief  Configures LEDs.
  * @param  Led LED to be configured.
  *          This parameter can be one of the following values:
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  *            @arg  LED5
  */
int32_t BSP_LED_Init(Led_TypeDef Led)
{
  int32_t  status = BSP_ERROR_NONE;
  GPIO_InitTypeDef  gpio_init_structure;
#if defined (MCP_IOEXPANDER)
  BSP_IO_Init_t io_init_structure;
#endif
  /* Enable the GPIO_LED clock */
  if(Led == LED3)
  {
    LED3_GPIO_CLK_ENABLE();
  }
  else if (Led == LED4)
  {
    LED4_GPIO_CLK_ENABLE();
  }
#if defined (MCP_IOEXPANDER) /* need MCP IOEXPANDER usage for LED6 and LED7*/
  else if (Led == LED6)
  {
    LED6_GPIO_CLK_ENABLE();
  }
  else if (Led == LED7)
  {
    LED7_GPIO_CLK_ENABLE();
  }
#endif

  /* Configure the GPIO_LED pin */
  if ((Led == LED3) || (Led == LED4))
  {
    gpio_init_structure.Pin = LED_PIN[Led];
    gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
    gpio_init_structure.Pull = GPIO_PULLUP;
    gpio_init_structure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    BSP_ENTER_CRITICAL_SECTION(LED_PORT[Led]);
    HAL_GPIO_Init(LED_PORT[Led], &gpio_init_structure);
    BSP_EXIT_CRITICAL_SECTION(LED_PORT[Led]);
  }
#if defined (MCP_IOEXPANDER)
  else
  {
    if (Led == LED6)
    {
      io_init_structure.Pin  = MCP23x17_GPIO_PIN_15;
    }
    else
    {
      io_init_structure.Pin  = MCP23x17_GPIO_PIN_14;
    }
    io_init_structure.Pull = IO_NOPULL;
    io_init_structure.Mode = IO_MODE_OUTPUT_PP;
    status += BSP_IO_Init(0, &io_init_structure);
  }
#endif

